Pinoccio/core-pinoccio/hardware/pinoccio/avr/boards.txt
##############################################################

pinoccio.name=Pinoccio

pinoccio.upload.protocol=arduino
pinoccio.upload.maximum_size=126976
pinoccio.upload.speed=57600
pinoccio.bootloader.high_fuses=0xDA
pinoccio.bootloader.low_fuses=0xF7
pinoccio.bootloader.extended_fuses=0xF5
pinoccio.bootloader.path=pinoccio
pinoccio.bootloader.file=ATmegaBOOT_atmega128rfa1.hex
pinoccio.bootloader.unlock_bits=0x3F
pinoccio.bootloader.lock_bits=0x0F

pinoccio.build.mcu=atmega128rfa1
pinoccio.build.f_cpu=16000000L
pinoccio.build.core=pinoccio
pinoccio.build.variant=pinoccio